{
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PUBLICATION_YEAR",
    "2": "B-DOI",
    "3": "B-ISBN",
    "4": "B-LOCATION",
    "5": "B-JOURNAL",
    "6": "B-LINK_ONLINE_AVAILABILITY",
    "7": "B-ISSN",
    "8": "B-PUBLISHER",
    "9": "B-PAGE_LAST",
    "10": "B-AUTHORS",
    "11": "B-PAGE_FIRST",
    "12": "B-TITLE",
    "13": "B-ISSUE",
    "14": "B-VOLUME",
    "15": "I-PUBLICATION_YEAR",
    "16": "I-DOI",
    "17": "I-ISBN",
    "18": "I-LOCATION",
    "19": "I-JOURNAL",
    "20": "I-LINK_ONLINE_AVAILABILITY",
    "21": "I-ISSN",
    "22": "I-PUBLISHER",
    "23": "I-PAGE_LAST",
    "24": "I-AUTHORS",
    "25": "I-PAGE_FIRST",
    "26": "I-TITLE",
    "27": "I-ISSUE",
    "28": "I-VOLUME"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AUTHORS": 10,
    "B-DOI": 2,
    "B-ISBN": 3,
    "B-ISSN": 7,
    "B-ISSUE": 13,
    "B-JOURNAL": 5,
    "B-LINK_ONLINE_AVAILABILITY": 6,
    "B-LOCATION": 4,
    "B-PAGE_FIRST": 11,
    "B-PAGE_LAST": 9,
    "B-PUBLICATION_YEAR": 1,
    "B-PUBLISHER": 8,
    "B-TITLE": 12,
    "B-VOLUME": 14,
    "I-AUTHORS": 24,
    "I-DOI": 16,
    "I-ISBN": 17,
    "I-ISSN": 21,
    "I-ISSUE": 27,
    "I-JOURNAL": 19,
    "I-LINK_ONLINE_AVAILABILITY": 20,
    "I-LOCATION": 18,
    "I-PAGE_FIRST": 25,
    "I-PAGE_LAST": 23,
    "I-PUBLICATION_YEAR": 15,
    "I-PUBLISHER": 22,
    "I-TITLE": 26,
    "I-VOLUME": 28,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.6",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
